// Обробники основних команд бота
import { helpMessage, helpMessageForAdmins } from "../config/constants.js";
import { isAdmin } from "../middlewares/admin.js";

/**
 * Обробник команди /start
 */
export function handleStart(ctx) {
  ctx.reply(
    `Привіт, ${ctx.from.first_name}. Тебе вітає Церква Христова в Вінниці. ✝️`
  );
  setTimeout(() => {
    ctx.reply(
      "📖 Вітаю! Я — внутрішній бот-помічник Церкви Христової. Моє завдання — допомагати братам і сестрам у служінні:\n• вести облік членів церкви;\n• приймати заявки на матеріальну чи духовну допомогу;\n• фіксувати молитвені потреби;\n• нагадувати про зібрання, зустрічі та служіння;\n• надсилати біблійні уроки й повідомлення громади.\n\n🕊️ Усе, що я роблю, покликане служити для порядку, спілкування та турботи одне про одно Христі.\n\nНапиши /help, щоб побачити список доступних команд."
    );
  }, 1000);
}

/**
 * Обробник команди /help
 */
export function handleHelp(ctx) {
  const userId = ctx.from.id;
  const message = isAdmin(userId) ? helpMessageForAdmins : helpMessage;
  ctx.reply(message);
}

